analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx.svd
<?xml version="1.0" encoding="UTF-8"?>
<device>
  <peripheral>
    <name>dbb_rx</name>
    <description>PAN2G RX Config</description>
    <baseAddress>TODO-base</baseAddress>
    <size>16</size>
    <registers>
      <register>
        <name>rx_info_version</name>
        <description>version</description>
        <addressOffset>0x0000</addressOffset>
        <fields>
          <field>
            <name>minor</name>
            <description>Version minor part</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>major</name>
            <description>Version major part</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_general_standard</name>
        <description>Standard: 1 = Zigbee (15.4), 2 = BAN (15.6),  3 = Bluetooth Low Energy (BTLE)</description>
        <addressOffset>0x0004</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>standard</name>
            <description>Wireless standard to use.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>zigbee</name>
                <description>Zigbee (15.4).</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ban</name>
                <description>BAN (15.6).</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>BTLE</name>
                <description>Bluetooth Low Energy (BTLE).</description>
                <value>3</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_general_control</name>
        <description>control</description>
        <addressOffset>0x0006</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>agc_enable</name>
            <description>Enable automatic gain control</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>reserved</name>
            <description>reserved for future use</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>phy_enable</name>
            <description>Enable BB PHY layer</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>dl_enable</name>
            <description>Enable BB datalink</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ph_mg_est_enable</name>
            <description>Enable phase magnitude estimator</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>cfo_hpf_enable</name>
            <description>Enable CFO high pass filter (only works when phase magnitude estimator is enabled)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>btle_lngrng_en</name>
            <description>If the PHY is configuted for BTLE use this bit to setup the phy in BTLE long range mode</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>disable_timing_sync</name>
            <description>If high then the timingsync algorithem is disabled</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>encryption_enable</name>
            <description>enables encryption</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_general_control</name>
        <description>control</description>
        <addressOffset>0x0008</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>sync_after_sig_detect</name>
            <description>Start timing sync and frame sync after signal is detected</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>start_cca</name>
            <description>Start clear channel assessment</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>cont_sync</name>
            <description>Continuous timing synchronization: 0 = Timing synchronization till PLD , 1 = Continuous timing synchronization during PLD</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>until_pld</name>
                <description>Timing synchronization till PLD.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>during_pld</name>
                <description>Continuous timing synchronization during PLD.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_general_agc_freeze_timer</name>
        <description>Set the amount of PHY clockcycles after signal detect after which the AGC gain control will be frozen </description>
        <addressOffset>0x000a</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_general_sig_detect_init_timer</name>
        <description>After activating the RX phy the agc and frondend are allowed sig_detect_init_timer clock ticks to settle at the initial gain of the AGC befor the signal detect logic is activated. This is required to prevent false signal detection. This feature is disabled if this register is set to 0</description>
        <addressOffset>0x000c</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_general_sig_detect_rst_timer</name>
        <description>After the AGC has switched without a signal detect beiing high then after sig_detect_rst_timer clock ticks and still nog signal detect the signal detect logic is reset. This allows the signal detect logic to "learn" the new noise level of the new gain and prevent false triggering. This feature is disabled if this register is set to 0</description>
        <addressOffset>0x000e</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_general_ddc_rst_timer</name>
        <description>Reset the DDC filter is there is no signal detect within the set amount of clk cycles to prevent leaning the wrong DC offset level due to interference; when set to 0 no rst is generated</description>
        <addressOffset>0x0010</addressOffset>
      </register>
      <register>
        <dim>8</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_ddc_alpha_start[%s]</name>
        <description>Dynamic DC offset compensation alpha start values (one value for each gain step)</description>
        <addressOffset>0x0014</addressOffset>
        <size>16</size>
      </register>
      <register>
        <dim>8</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_ddc_alpha_stop[%s]</name>
        <description>Dynamic DC offset compensation alpha stop values (one value for each gain step)</description>
        <addressOffset>0x0024</addressOffset>
        <size>16</size>
      </register>
      <register>
        <dim>8</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_ddc_alpha_step[%s]</name>
        <description>Dynamic DC offset compensation alpha step values (one value for each gain step)</description>
        <addressOffset>0x0034</addressOffset>
        <size>16</size>
      </register>
      <register>
        <dim>8</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_ddc_beta[%s]</name>
        <description>Dynamic DC offset compensation Beta values (one value for each gain step)</description>
        <addressOffset>0x0044</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_ddc_rst_tmr</name>
        <description>Setpoint for the filter reset delay; After the agc_enc is ready with writting new AFE settings wait i_cgf_rst_tmr clk cycles and reset the DDC filter</description>
        <addressOffset>0x0054</addressOffset>
        <size>16</size>
      </register>
      <register>
        <dim>8</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_ddc_offs_i[%s]</name>
        <description>Signed value that will be added to the I channel befor the DC offset filter to allow manual correction of the DC offset, one value per AGC gain step</description>
        <addressOffset>0x0056</addressOffset>
        <size>16</size>
      </register>
      <register>
        <dim>8</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_ddc_offs_q[%s]</name>
        <description>Signed value that will be added to the Q channel befor the DC offset filter to allow manual correction of the DC offset, one value per AGC gain step</description>
        <addressOffset>0x0066</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_overwr</name>
        <description>overwr</description>
        <addressOffset>0x0078</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>wr_gain</name>
            <description>Change gain to fixed value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>new_gain</name>
            <description>Gain level used when gain is fixed</description>
            <bitOffset>1</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_agc5_gain</name>
        <description>gain</description>
        <addressOffset>0x007a</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>init</name>
            <description>Gain index used at beginning of procedure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>min</name>
            <description>Minimum gain index</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>max</name>
            <description>Maximum gain index</description>
            <bitOffset>6</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>index</name>
            <description>Gain index readout for debug purposes</description>
            <bitOffset>9</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_agc5_thresh7upper</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x007c</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh7lower</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x007e</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh6upper</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x0080</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh6lower</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x0082</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh5upper</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x0084</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh5lower</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x0086</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh4upper</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x0088</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh4lower</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x008a</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh3upper</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x008c</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh3lower</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x008e</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh2upper</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x0090</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh2lower</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x0092</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh1upper</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x0094</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh1lower</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x0096</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh0upper</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x0098</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_thresh0lower</name>
        <description>Gain is increased/decreased when samples are above/below this threshold</description>
        <addressOffset>0x009a</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_agc5_row_upper</name>
        <description>row_upper</description>
        <addressOffset>0x009c</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>le</name>
            <description>specifies if gain is incremented when samples are larger-or-equal to this threshold (smaller otherwise)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>incr</name>
            <description>specifies the increment value (signed - can be used to increase and decrease)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>blk</name>
            <description>Specifies the number of blocks the threshold has to be reached before the gain is changed.  </description>
            <bitOffset>5</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_agc5_row_lower</name>
        <description>row_lower</description>
        <addressOffset>0x009e</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>le</name>
            <description>specifies if gain is incremented when samples are larger-or-equal to this threshold (smaller otherwise)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>incr</name>
            <description>specifies the increment value (signed - can be used to increase and decrease)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>blk</name>
            <description>Specifies the number of blocks the threshold has to be reached before the gain is changed.  </description>
            <bitOffset>5</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_agc5_cntr</name>
        <description>cntr</description>
        <addressOffset>0x00a0</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>stable</name>
            <description>Number of samples in a block and also number valid samples before gain is considered stable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>valid</name>
            <description>Number of samples needed after a gain change before samples are considered valid</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_agc5_offs_init</name>
        <description>offs_init</description>
        <addressOffset>0x00a2</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>start</name>
            <description>Initialize offset table</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>done</name>
            <description>Offset table has been initialized.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <dim>10</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_phsmagest_filter_coeff[%s]</name>
        <description>Filter to open the phase magniture output eye *signed*.</description>
        <addressOffset>0x00a4</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_phsmagest_scaling_factor</name>
        <description>Scalingfactor for the eye opening filter</description>
        <addressOffset>0x00b8</addressOffset>
      </register>
      <register>
        <dim>16</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_filters_coefficients[%s]</name>
        <description>Filter coefficients *signed*.</description>
        <addressOffset>0x00bc</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_filters_settings</name>
        <description>settings</description>
        <addressOffset>0x00dc</addressOffset>
        <fields>
          <field>
            <name>skip_mux_sel</name>
            <description>Filter length selection. When bit x is 1, data is input after 3x taps, effectively bypassing them.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>scaling_factor</name>
            <description>Number of bits that filter output must be shifted right</description>
            <bitOffset>6</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_rssi_settings</name>
        <description>settings</description>
        <addressOffset>0x00e0</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>num_calc</name>
            <description>Number of consecutive RSSI calculations</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>pow_two_samples</name>
            <description>Number of samples to average over per RSSI calculation is equal to 2^"pow_two_samples"</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>comp_fact</name>
            <description>Compansation factor in dB to compensate for: receiver sensitivity, filter gain, etc. (two's complement format)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_rssi_ed_threshold</name>
        <description>Energy detection threshold in dBm; must be compensated when multiple consecutive RSSI calculations are done. (two's complement format)</description>
        <addressOffset>0x00e2</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_signal_det_settings</name>
        <description>settings</description>
        <addressOffset>0x00e4</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>div_factor</name>
            <description>Threshold that the average signal power needs to cross, before a signal is detected</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>delta_samples</name>
            <description>Number samples difference to calculate rise of avg after filter with</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_signal_det_thresholds</name>
        <description>thresholds</description>
        <addressOffset>0x00e6</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>delta_amp</name>
            <description>Threshold for difference in "i_delta_samples" number of samples</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>noise_factor</name>
            <description>Threshold factor for scaling the threshold up</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_signal_det_select_v2</name>
        <description>Signal detector block selection (0=old V1 implementation, 1=new V2 implementation)</description>
        <addressOffset>0x00e8</addressOffset>
        <size>16</size>
      </register>
