analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx.svd
      <register>
        <name>rx_phy_signal_det_settings_v2_div_factor</name>
        <description>settings_v2</description>
        <addressOffset>0x00ea</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>div_factor</name>
            <description>Threshold that the average signal power needs to cross, before a signal is detected</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_signal_det_gear_v2</name>
        <description>gear_v2</description>
        <addressOffset>0x00ec</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>delta</name>
            <description>Slow IIR gear increment</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>start</name>
            <description>Slow IIR initial gear value (-2 ~ 0)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>max</name>
            <description>Slow IIR final gear value</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>step</name>
            <description>Slow IIR gear update step (input samples)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_signal_det_thresholds_v2_noise_factor</name>
        <description>thresholds_v2</description>
        <addressOffset>0x00ee</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>noise_factor</name>
            <description>Threshold factor for scaling the threshold up (2 integer and 3 fractional bits)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_frame_sync_pd_comp</name>
        <description>pd_comp</description>
        <addressOffset>0x00f0</addressOffset>
        <fields>
          <field>
            <name>comp_all_gain_corr</name>
            <description>Compensate for all gain corrections: 1 = Compensate all, 0 = Only compensate for first correction</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>all</name>
                <description>Compensate all.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>first</name>
                <description>Only compensate for first correction.</description>
                <value>0</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>num_samples_corr</name>
            <description>Number of samples set to zero after AGC gain correction</description>
            <bitOffset>1</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <dim>4</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_frame_sync_sfd</name>
        <description>Start of frame delimiter (last 64 bits of preamble + sfd sequence).</description>
        <addressOffset>0x00f4</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_frame_sync_settings</name>
        <description>settings</description>
        <addressOffset>0x00fc</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>corr_length</name>
            <description>Number if LSBs in "sfd" used for correlation. </description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>thresh_factor</name>
            <description>Multiplication factor which determines the synchronization threshold (Must be smaller then "corr_length").</description>
            <bitOffset>7</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>hard_detect</name>
            <description>Detection mode: 1 = bit based hard detection, 0 = phase sample based soft detection</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>all</name>
                <description>bit based hard detection.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sample</name>
                <description>phase sample based soft detection.</description>
                <value>0</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_frame_sync_settings_min_corr_val</name>
        <description>Minimal correlation value before a start of frame is detected. It can be used as an extra measure against false start of frame detections.</description>
        <addressOffset>0x00fe</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_frame_sync_timeout_tmr_periode</name>
        <description>Start of frame detection timeout timer  period. Setting this periode to zero disables the timer. The timer runs on the RX clock frequency.</description>
        <addressOffset>0x0100</addressOffset>
      </register>
      <register>
        <name>rx_phy_timing_sync_cfg</name>
        <description>cfg</description>
        <addressOffset>0x0104</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>limit</name>
            <description>All input values above this set threshold are treaded as non-valid input samples by the module</description>
            <bitOffset>0</bitOffset>
            <bitWidth>9</bitWidth>
          </field>
          <field>
            <name>bitshift</name>
            <description>The amount of bitshifts that are done after the accumulator (default /64)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_timing_sync_log_sum</name>
        <description>Log the current value of the acculator logic for debugging / monitoring</description>
        <addressOffset>0x0106</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_tim_sync_old_cfg</name>
        <description>Timing sync general config: 0 = Dynamic thresholding mode, 1 = Static thresholding mode</description>
        <addressOffset>0x0108</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>cfg</name>
            <description>All input values above this set threshold are treaded as non-valid input samples by the module</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>static</name>
                <description>Static thresholding mode.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>dynamic</name>
                <description>Dynamic thresholding mode.</description>
                <value>0</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_tim_sync_old_te_thresh</name>
        <description>Timing error static threshold value (for static thresholding mode)</description>
        <addressOffset>0x010a</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_tim_sync_old_te_thresh_scaling</name>
        <description>Timing error dynamic threshold scaling config (for dynamic thresholding mode)</description>
        <addressOffset>0x010c</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_tim_sync_old_init</name>
        <description>init</description>
        <addressOffset>0x010e</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>sel_cnt_max</name>
            <description>Maximum value of sample select counter</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>min_num_chip</name>
            <description>Minimum number of symbols before starting adjustments (after TS is enabled)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_tim_sync_old_te_cnt_thresh</name>
        <description>te_cnt_thresh</description>
        <addressOffset>0x0110</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>value</name>
            <description>Timing error counter threshold value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>incr_value</name>
            <description>Timing error counter threshold increase value (after each adjustment)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_tim_sync_old_te_cnt</name>
        <description>te_cnt</description>
        <addressOffset>0x0112</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>incr_value</name>
            <description>Timing error counter increase value (when timing error detected for current symbol)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>decr_value</name>
            <description>Timing error counter decrease value (when no timing error detected for current symbol)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_tim_sync_old_te_fifo_max_ptr</name>
        <description>Number of timing error events to be averaged</description>
        <addressOffset>0x0114</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_tim_sync_old_adjust_cnt</name>
        <description>adjust_cnt</description>
        <addressOffset>0x0116</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>is_fast</name>
            <description>Number of adjustments due to early sampling (read-only status register)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>is_slow</name>
            <description>Number of adjustments due to late sampling (read-only status register)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_cfo_cfg</name>
        <description>CFO estimation and compensation config general (cfg(0)=enable, cfg(1)=comp. enable, cfg(2)=comp. data sign invert, cfg(3)=comp. data SW override enable, cfg(31) and cfg(24:16)=CFO comp. data used in override mode)</description>
        <addressOffset>0x0118</addressOffset>
        <size>32</size>
         <fields>
          <field>
            <name>enable</name>
            <description>enable.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>comp_enable</name>
            <description>comp_enable.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>comp_inv</name>
            <description>comp data sign invert.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>sw_over</name>
            <description>comp. data SW override enable.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>comp_data0</name>
            <description>cfg(31) and cfg(24:16)=CFO comp. data used in override mode).</description>
            <bitOffset>16</bitOffset>
            <bitWidth>9</bitWidth>
          </field>
          <field>
            <name>comp_data1</name>
            <description>cfg(31) and cfg(24:16)=CFO comp. data used in override mode).</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <dim>9</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_cfo_filter_coefficients</name>
        <description>CFO comp. filter coefficients</description>
        <addressOffset>0x011c</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_cfo_filter_scaling</name>
        <description>CFO comp. filter scaling</description>
        <addressOffset>0x012e</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_cfo_pa_precnt_num</name>
        <description>CFO comp. delay between internal energy detection and start of CFO measurement</description>
        <addressOffset>0x0130</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_cfo_ph_accum_part_num</name>
        <description>CFO comp. number of samples to accumulate for partial CFO estimate</description>
        <addressOffset>0x0132</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_cfo_ed_thresh_factor</name>
        <description>CFO comp. energy detection threshold</description>
        <addressOffset>0x0134</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_cfo_ed_slow_factor</name>
        <description>CFO comp. slow energy estimate scaling factor</description>
        <addressOffset>0x0136</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_cfo_ed_fast_factor</name>
        <description>CFO comp. fast energy estimate scaling factor</description>
        <addressOffset>0x0138</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_cfo_pa_max_limit_val</name>
        <description>CFO comp. maximum phase accumulation value limit</description>
        <addressOffset>0x013c</addressOffset>
      </register>
      <register>
        <name>rx_phy_cfo_cfo_est</name>
        <description>CFO comp. CFO estimation result (scaled)</description>
        <addressOffset>0x0140</addressOffset>
      </register>
      <register>
        <name>rx_phy_cfo_cfo_est_khz</name>
        <description>CFO comp. CFO estimation result (kHz)</description>
        <addressOffset>0x0144</addressOffset>
      </register>
      <register>
        <name>rx_debug_dl_lb</name>
        <description>loop back datalink: 0 = normal mode, 1 = loopback mode</description>
        <addressOffset>0x0148</addressOffset>
        <fields>
          <field>
            <name>loop</name>
            <description>loop back datalink</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>loopback</name>
                  <description>loopback mode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>normal</name>
                  <description>normal mode.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_dbg_cfg</name>
        <description>RX debug config (cfg(0)=enable, cfg(1)=log to mem enable, cfg(4:2)=data source (0=IQ (after AGC), 1=IQ (after filter), 2=IQ (before AGC), 3=phase diff, 4=dbg counter))</description>
        <addressOffset>0x014c</addressOffset>
        <fields>
          <field>
            <name>enable</name>
            <description>enable.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>log</name>
            <description>log to mem enable.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>src</name>
            <description>data source.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>iq_after_agc</name>
                  <description>IQ after AGC.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>iq_after_filter</name>
                  <description>IQ after filter.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>iq_before_agc</name>
                  <description>IQ before AGC.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>phase</name>
                  <description>phase diff.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dbg_counter</name>
                  <description>dbg counter.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_dbg_data</name>
        <description>RX debug IQ data register</description>
        <addressOffset>0x0150</addressOffset>
      </register>
      <register>
        <name>rx_dl_bypass</name>
        <description>Bypass the datalink layer. When this bit is set the payload data is sent directly to the payload memory</description>
        <addressOffset>0x0154</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_dl_crc_mode</name>
        <description>crc_mode</description>
        <addressOffset>0x0156</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>phr</name>
            <description>Header  CRC type: 0 = data bypassed, 1 = CRC-4, 2 = CRC-16, 3 = CRC-24</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>byp</name>
                  <description>data bypassed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc4</name>
                  <description>CRC-4.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc16</name>
                  <description>CRC-16.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc24</name>
                  <description>CRC-24.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
          <field>
            <name>pld</name>
            <description>Payload CRC type: 0 = data bypassed, 1 = CRC-4,  2= CRC-16, 3 = CRC-24</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>byp</name>
                  <description>data bypassed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc4</name>
                  <description>CRC-4.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc16</name>
                  <description>CRC-16.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>crc24</name>
                  <description>CRC-24.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_dl_crc_init_phr</name>
        <description>CRC LFSR initialization value for the header</description>
        <addressOffset>0x0158</addressOffset>
      </register>
      <register>
        <name>rx_dl_crc_init_pld</name>
        <description>CRC LFSR initialization value for the payload</description>
        <addressOffset>0x015c</addressOffset>
      </register>
      <register>
        <name>rx_dl_crc_residu</name>
        <description>The CRC residue value</description>
        <addressOffset>0x0160</addressOffset>
      </register>
      <register>
        <name>rx_dl_bch</name>
        <description>bch</description>
        <addressOffset>0x0164</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>phr_enable</name>
            <description>BCH decoding enabled on the header</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>pld_enable</name>
            <description>BCH decoding enabled on the payload</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>bit_err_nr</name>
            <description>BCH errors counter (bit error counter per frame)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_dl_sprd_seq_err_nr</name>
        <description>sprd</description>
        <addressOffset>0x0166</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>seq_err_nr</name>
            <description>Despreader errors counter (sequence error counter per frame)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
