analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx.svd
      <register>
        <name>rx_dl_ban_settings</name>
        <description>ban_settings</description>
        <addressOffset>0x0168</addressOffset>
        <fields>
          <field>
            <name>phr_scrmbl_sd</name>
            <description>Header scrambler seed, used to initialize the LFSR of the scrambler module when processing the header</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>phr_sprd_fact</name>
            <description>Header spread factor: 1 = sprd_fact_1, 2 = sprd_fact_2, 3 = sprd_fact_4, 4 = sprd_fact_8, 5 = sprd_fact_16</description>
            <bitOffset>1</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>sprd_fact_1</name>
                  <description>sprd_fact_1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_2</name>
                  <description>sprd_fact_2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_4</name>
                  <description>sprd_fact_4.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_8</name>
                  <description>sprd_fact_8.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_16</name>
                  <description>sprd_fact_16.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
          <field>
            <name>mdr_length</name>
            <description>MAC header length in bytes</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>prop_pld_mod</name>
            <description>Proprietary mode payload modulation: OQPSK=0,  1 = DBPSK 2 = DQPSK, 3 = D8PSK, 4 = GMSK, 5 = GFSK</description>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>OQPSK</name>
                  <description>OQPSK.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBPSK</name>
                  <description>DBPSK.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DQPSK</name>
                  <description>DQPSK.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8PSK</name>
                  <description>D8PSK.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GMSK</name>
                  <description>GMSK.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GFSK</name>
                  <description>GFSK.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
          <field>
            <name>prop_pld_sprd_fact</name>
            <description>Proprietary mode payload spread factor: 1 = sprd_fact_1, 2 = sprd_fact_2, 3 = sprd_fact_4, 4 = sprd_fact_8, 5 = sprd_fact_16</description>
            <bitOffset>11</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
                <enumeratedValue>
                  <name>sprd_fact_1</name>
                  <description>sprd_fact_1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_2</name>
                  <description>sprd_fact_2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_4</name>
                  <description>sprd_fact_4.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_8</name>
                  <description>sprd_fact_8.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sprd_fact_16</name>
                  <description>sprd_fact_16.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_dl_btle_settings_adv_acc_addr</name>
        <description>Advertisement channel access address used to determine if frame is for advertisement channel</description>
        <addressOffset>0x016c</addressOffset>
      </register>
      <register>
        <name>rx_dl_btle_settings_whit</name>
        <description>btle_settings_whit</description>
        <addressOffset>0x0170</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>chan_nr</name>
            <description>Channel number used dewhitening</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>bypass</name>
            <description>Whitening bypass enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_dl_phr_modulation</name>
        <description>Header modulation: OQPSK=0,  1 = DBPSK 2 = DQPSK, 3 = D8PSK, 4 = GMSK, 5 = GFSK</description>
        <addressOffset>0x0172</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>mod</name>
            <description>Header modulation.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>OQPSK</name>
                <description>OQPSK.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DBPSK</name>
                <description>DBPSK.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DQPSK</name>
                <description>DQPSK.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>D8PSK</name>
                <description>D8PSK.</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>GMSK</name>
                <description>GMSK.</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>GFSK</name>
                <description>GFSK.</description>
                <value>5</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_phy_rssi_out_pwr</name>
        <description>Power calculated by the RSSI module in dBm. (two's complement format)</description>
        <addressOffset>0x0174</addressOffset>
      </register>
      <register>
        <name>rx_dl_out_crc_stat</name>
        <description>crc_stat</description>
        <addressOffset>0x0178</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>phr_nok</name>
            <description>PHR CRC status bit: 0 = CRC is okay, 1 = CRC is not okay</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>pld_nok</name>
            <description>PLD CRC status bit: 0 = CRC is okay, 1 = CRC is not okay</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>rx_dl_out_phr</name>
        <description>Header containing standard dependant information</description>
        <addressOffset>0x017a</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_dl_out_acc_add_nok</name>
        <description>Is high when in coded phy mode the received access adress is not matching with the expected address and via this way the rx is terminated</description>
        <addressOffset>0x017c</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_dl_out_ci</name>
        <description>When receiving a BTLE coded phy packet this field will indicate the value of the CI field (00 = S8 mode, 01=S2 mode, others resevered for future use)</description>
        <addressOffset>0x017e</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>ci</name>
            <description>ci field of packet.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <enumeratedValues>
              <enumeratedValue>
                <name>S8</name>
                <description>S8.</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>S2</name>
                <description>S2.</description>
                <value>1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <dim>66</dim>
        <dimIncrement>4</dimIncrement>
        <name>rx_pld_mem</name>
        <description>Payload memory: 66 address</description>
        <addressOffset>0x0180</addressOffset>
      </register>
      <register>
        <name>rx_phy_signal_det2_timeout_tmr_periode</name>
        <description>Signal detect timeout timer which goes off when no SFD is detected.  Setting this periode to zero disables the timer. The timer runs on the RX clock frequency.</description>
        <addressOffset>0x0288</addressOffset>
      </register>
      <register>
        <name>rx_phy_signal_det2_ed_slow_fact</name>
        <description>Energy detection slow factor</description>
        <addressOffset>0x028c</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_signal_det2_ed_fast_fact</name>
        <description>Energy detection fast factor</description>
        <addressOffset>0x028e</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_signal_det2_ed_threshold_fact</name>
        <description>Energy detection threshold factor</description>
        <addressOffset>0x0290</addressOffset>
      </register>
      <register>
        <name>rx_phy_signal_det2_ed_timeout_tmr_periode</name>
        <description>Energy detection timeout timer periode</description>
        <addressOffset>0x0294</addressOffset>
      </register>
      <register>
        <name>rx_phy_signal_det2_stop_high_filt_corner</name>
        <description>Number of samples it takes to go from alpha/beta/gamma 2 to alpha/beta/gamma 3</description>
        <addressOffset>0x0298</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_signal_det2_beta_mux_en_stage</name>
        <description>Filter multiplexer enable stage (0 = multiplexer and beta filter disabled), 1 = alpha 1,  2 = alpha 2,  3 = alpha 3,  4 = alpha 4) </description>
        <addressOffset>0x029a</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_signal_det2_beta_mux_threshold</name>
        <description>Beta filter select threshold</description>
        <addressOffset>0x029c</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>rx_phy_signal_det2_gamma_mux_en_stage</name>
        <description>Filter multiplexer enable stage (0 = multiplexer and gamma filter disabled), 1 = alpha 1,  2 = alpha 2,  3 = alpha 3,  4 = alpha 4) </description>
        <addressOffset>0x02a0</addressOffset>
      </register>
      <register>
        <name>rx_phy_signal_det2_gamma_mux_threshold</name>
        <description>Gamma filter select threshold</description>
        <addressOffset>0x02a4</addressOffset>
      </register>
      <register>
        <dim>4</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_signal_det2_alpha</name>
        <description>Filter multiplication factor for alpha filter</description>
        <addressOffset>0x02a8</addressOffset>
        <size>16</size>
      </register>
      <register>
        <dim>4</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_signal_det2_beta</name>
        <description>Filter multiplication factor for beta filter</description>
        <addressOffset>0x02b0</addressOffset>
        <size>16</size>
      </register>
      <register>
        <dim>4</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_signal_det2_gamma</name>
        <description>Filter multiplication factor for gamma filter</description>
        <addressOffset>0x02b8</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_cfo2_ed_timeout_tmr_periode</name>
        <description>Coarse CFO energy detection timeout timer periode</description>
        <addressOffset>0x02c0</addressOffset>
      </register>
      <register>
        <name>rx_phy_cfo2_cfg_ph_accum_upscl_fact</name>
        <description>Coarse CFO phase accumulation upscaling multiplication factor</description>
        <addressOffset>0x02c4</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_cfo2_cfg_ph_accum_dwnscl_fact</name>
        <description>Coarse CFO phase accumulation downscaling division factor (downscaling is done by 2^cfg_ph_accum_dwnscl_fact)</description>
        <addressOffset>0x02c6</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_cfo2_cfg_ph_accum_comp</name>
        <description>Coarse CFO phase accumulation compensation for compensating default phase information</description>
        <addressOffset>0x02c8</addressOffset>
      </register>
      <register>
        <name>rx_phy_btlespeed_anti_alias_enable</name>
        <description>Anti-alias filter enable for BTLE high-speed mode</description>
        <addressOffset>0x02cc</addressOffset>
        <size>16</size>
      </register>
      <register>
        <dim>4</dim>
        <dimIncrement>2</dimIncrement>
        <name>rx_phy_btlespeed_filter_coeff</name>
        <description>Anti-alias filter coefficients (7-TAPs)</description>
        <addressOffset>0x02ce</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_btlespeed_scaling_factor</name>
        <description>Anti-alias filter scalingfactor</description>
        <addressOffset>0x02d6</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_frame_sync_lr_corr_length</name>
        <description>Number if LSBs in "sfd" used for correlation when in coded phy mode</description>
        <addressOffset>0x02d8</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>rx_phy_frame_sync_lr_thresh_factor</name>
        <description>Multiplication factor which determines the synchronization threshold (Must be smaller then "corr_length") when in coded phy mode</description>
        <addressOffset>0x02da</addressOffset>
        <size>16</size>
      </register>
    </registers>
  </peripheral>
</device>
